*** [#A] Convert seds for use in in Cloudy
+ Look up how I did this for the Raman project
  + The best example seems to be [[id:534BA570-96A5-4014-9FFF-8450B46BFA0A][Combine fine and coarse and make them suitable for Cloudy]]
  + For this project, the coarse SEDs should be sufficient,
    + but I still need to convert them to Cloudy's expected units
    + and maybe I should check for duplicates while I am at it


#+begin_src python
  from pathlib import Path
  import numpy as np

  datapath = Path("../stars/powr/seds")

  infiles = datapath.glob("*_sed.txt")


  wavtot = None
  for infile in infiles:
      wav, flam = np.loadtxt(infile, unpack=True)

      # Make sure no repeated entries
      wav_unique = np.sort(list(set(wav)))
      flam_unique = np.interp(wav_unique, wav, flam)

      # Write out a version to be used with Cloudy's "table SED" command

      # Energy in Rydbergs
      e_ryd = 1e8/(1.09737315685e5 * 10**wav_unique)
      # Use that Fnu = (lam/nu) Flam = (lam**2 / c) Flam and don't worry
      # about the normalization
      Fnu = 10**(flam_unique + 2*wav_unique)

      outfile = str(infile).replace("_sed.txt", ".sed")
      # Write out the sed in fixed-width 14-character columns
      header = f"{'E, Ryd':14s}{'F_nu':14s}"
      data = list(zip(e_ryd[::-1], Fnu[::-1]))
      np.savetxt(outfile, data, header=header, fmt="%14.7e")


#+end_src

#+RESULTS:
: None

Copy SED files to cloudy model folder

#+begin_src sh :results verbatim
cp -pv ../stars/powr/seds/*.sed ../cloudy/models
#+end_src

#+RESULTS:
: ../stars/powr/seds/smc-ob-i_49-42.sed -> ../cloudy/models/smc-ob-i_49-42.sed
: ../stars/powr/seds/smc-ob-i_50-42.sed -> ../cloudy/models/smc-ob-i_50-42.sed
: ../stars/powr/seds/smc-ob-ii_49-42.sed -> ../cloudy/models/smc-ob-ii_49-42.sed
: ../stars/powr/seds/smc-ob-ii_50-42.sed -> ../cloudy/models/smc-ob-ii_50-42.sed
: ../stars/powr/seds/smc-ob-iii_49-42.sed -> ../cloudy/models/smc-ob-iii_49-42.sed
: ../stars/powr/seds/smc-ob-iii_50-42.sed -> ../cloudy/models/smc-ob-iii_50-42.sed

